{"format": "graph-model", "generatedBy": "1.14.0", "convertedBy": "TensorFlow.js Converter v1.3.2", "userDefinedMetadata": {"signature": {"inputs": {"Placeholder:0": {"name": "Placeholder:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "strided_slice_3:0": {"name": "strided_slice_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}, {"size": "1024"}, {"size": "2"}]}}, "Placeholder_1:0": {"name": "Placeholder_1:0", "dtype": "DT_STRING", "tensorShape": {"unknownRank": true}}, "transpose_1:0": {"name": "transpose_1:0", "dtype": "DT_COMPLEX64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2049"}, {"size": "2"}]}}}, "outputs": {"Placeholder_1:0": {"name": "Placeholder_1:0", "dtype": "DT_STRING", "tensorShape": {"unknownRank": true}}, "strided_slice_23:0": {"name": "strided_slice_23:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "strided_slice_13:0": {"name": "strided_slice_13:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}}, "modelTopology": {"node": [{"name": "Placeholder", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Placeholder_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_STRING"}, "shape": {"shape": {"unknownRank": true}}}}, {"name": "transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "stft/frame_length", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "stft/frame_step", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "stft/frame/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "stft/frame/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "stft/frame/packed", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "stft/frame/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "stft/frame/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "stft/frame/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "stft/frame/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "stft/frame/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "stft/frame/zeros_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "stft/frame/Reshape_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "stft/hann_window/sub_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "FloorMod/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "strided_slice_3/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_3/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "conv2d/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "2"}, {"size": "16"}]}}}}}, {"name": "conv2d/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_learning_phase/input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "conv2d_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inverse_stft_1/overlap_and_add/concat_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "batch_normalization_2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/moving_mean", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "batch_normalization_2/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/moving_mean", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "batch_normalization_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_4/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_4/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "batch_normalization_4/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_5/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_5/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inverse_stft_1/overlap_and_add/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_transpose/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_transpose/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "batch_normalization_6/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_6/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "concatenate/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "conv2d_transpose_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_1/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "batch_normalization_7/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_7/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_2/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "inverse_stft_1/overlap_and_add/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_transpose_2/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "batch_normalization_8/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_8/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_3/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "batch_normalization_9/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_9/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_4/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "16"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_4/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_4/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "batch_normalization_10/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_10/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_5/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_5/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_11/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_11/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_11/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_11/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_6/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_6/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inverse_stft_1/overlap_and_add/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_6/SpaceToBatchND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_6/SpaceToBatchND/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_6/BatchToSpaceND/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_7/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "2"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_7/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_12/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_12/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_8/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_8/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_13/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_13/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "conv2d_9/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_9/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_14/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_14/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_10/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "conv2d_10/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_15/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_15/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_11/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "conv2d_11/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_16/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_16/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_12/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "256"}, {"size": "512"}]}}}}}, {"name": "conv2d_12/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inverse_stft_1/overlap_and_add/strided_slice_4/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_transpose_6/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_6/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mul_5/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_18/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_18/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_7/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_7/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_19/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_19/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_8/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_8/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_20/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_20/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_9/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_9/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_21/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "batch_normalization_21/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_10/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "16"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_10/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "batch_normalization_22/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_22/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_11/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_11/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_23/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_23/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_13/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_13/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "add_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "add_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_6/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inverse_stft/overlap_and_add/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "stft/rfft/packed", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "stft/frame/zeros", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "stft/frame/zeros_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Shape_6", "op": "Shape", "input": ["Placeholder"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "transpose", "op": "Transpose", "input": ["Placeholder", "transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "keras_learning_phase", "op": "PlaceholderWithDefault", "input": ["keras_learning_phase/input"], "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "strided_slice_12", "op": "StridedSlice", "input": ["Shape_6", "strided_slice/stack", "stft/frame/strided_slice_1/stack", "stft/frame/strided_slice_1/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "stft/frame/Shape", "op": "Shape", "input": ["transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "batch_normalization/cond/Switch", "op": "Switch", "input": ["keras_learning_phase", "keras_learning_phase"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "batch_normalization/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/FusedBatchNorm_1/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization/moving_mean", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/FusedBatchNorm_1/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization/moving_variance", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_1/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_1/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/cond/FusedBatchNorm_1/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_1/moving_mean", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/cond/FusedBatchNorm_1/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_1/moving_variance", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_2/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_2/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/cond/FusedBatchNorm_1/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_2/moving_mean", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/cond/FusedBatchNorm_1/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_2/moving_variance", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_3/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_3/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/cond/FusedBatchNorm_1/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_3/moving_mean", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/cond/FusedBatchNorm_1/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_3/moving_variance", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_4/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_4/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/cond/FusedBatchNorm_1/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_4/moving_mean", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/cond/FusedBatchNorm_1/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_4/moving_variance", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_6/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_6/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_6/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_6/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_7/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_7/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_7/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_7/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_8/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_8/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_8/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_8/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_9/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_9/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_9/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_9/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_10/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_10/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_10/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_10/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_11/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_11/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_11/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_11/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_11/cond/FusedBatchNorm_1/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_11/moving_mean", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_11/cond/FusedBatchNorm_1/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_11/moving_variance", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_12/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_12/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_12/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_12/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_13/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_13/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_13/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_13/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_14/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_14/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_14/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_14/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_15/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_15/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_15/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_15/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_16/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_16/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_16/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_16/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_18/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_18/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_18/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_18/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_19/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_19/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_19/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_19/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_20/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_20/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_20/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_20/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_21/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_21/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_21/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_21/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_22/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_22/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_22/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_22/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_23/cond/ReadVariableOp/Switch", "op": "Switch", "input": ["batch_normalization_23/gamma", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_23/cond/ReadVariableOp_1/Switch", "op": "Switch", "input": ["batch_normalization_23/beta", "keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_13/stack_1", "op": "Pack", "input": ["strided_slice_12", "stft/frame/split/split_dim"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "stft/frame/split", "op": "SplitV", "input": ["stft/frame/Shape", "stft/frame/packed", "stft/frame/split/split_dim"], "attr": {"num_split": {"i": "3"}, "Tlen": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "batch_normalization/cond/switch_t", "op": "Identity", "input": ["batch_normalization/cond/Switch:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "stft/frame/Reshape", "op": "Reshape", "input": ["stft/frame/split:1", "stft/frame/Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "batch_normalization/cond/Const", "op": "Const", "input": ["^batch_normalization/cond/switch_t"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout/cond/dropout/rate", "op": "Const", "input": ["^batch_normalization/cond/switch_t"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout/cond/dropout/truediv", "op": "Const", "input": ["^batch_normalization/cond/switch_t"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "stft/frame/Neg", "op": "Neg", "input": ["stft/frame/Reshape"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "stft/frame/floordiv", "op": "FloorDiv", "input": ["stft/frame/Neg", "stft/frame_step"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "stft/frame/Neg_1", "op": "Neg", "input": ["stft/frame/floordiv"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "stft/frame/concat_3/values_1", "op": "Pack", "input": ["stft/frame/Neg_1", "stft/frame_length"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "stft/frame/sub_2", "op": "Sub", "input": ["stft/frame/Neg_1", "stft/frame/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "stft/frame/range_1", "op": "Range", "input": ["stft/frame/split/split_dim", "stft/frame/Neg_1", "stft/frame/strided_slice"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "stft/frame/Reshape_2/shape", "op": "Pack", "input": ["stft/frame/Neg_1", "stft/frame/strided_slice"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "stft/frame/concat_3", "op": "ConcatV2", "input": ["stft/frame/split", "stft/frame/concat_3/values_1", "stft/frame/split:2", "stft/frame/split/split_dim"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "stft/frame/mul", "op": "Mul", "input": ["stft/frame/sub_2", "stft/frame_step"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "stft/frame/Reshape_2", "op": "Reshape", "input": ["stft/frame/range_1", "stft/frame/Reshape_2/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "stft/frame/add_1", "op": "Add", "input": ["stft/frame/mul", "stft/frame_length"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "stft/frame/add_3", "op": "Add", "input": ["stft/frame/Reshape_2", "stft/frame/Reshape_3"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "stft/frame/sub_3", "op": "Sub", "input": ["stft/frame/add_1", "stft/frame/Reshape"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "stft/frame/Maximum", "op": "Maximum", "input": ["stft/frame/split/split_dim", "stft/frame/sub_3"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "stft/frame/concat/values_1/0", "op": "Pack", "input": ["stft/frame/split/split_dim", "stft/frame/Maximum"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/stft/frame/concat/values_1_const_axis", "op": "Const", "input": ["^stft/frame/concat/values_1/0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "stft/frame/concat/values_1", "op": "ExpandDims", "input": ["stft/frame/concat/values_1/0", "ConstantFolding/stft/frame/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "stft/frame/concat", "op": "ConcatV2", "input": ["stft/frame/zeros", "stft/frame/concat/values_1", "stft/frame/zeros_1", "stft/frame/split/split_dim"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "stft/frame/PadV2", "op": "PadV2", "input": ["transpose", "stft/frame/concat", "stft/frame/Const"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "stft/frame/Shape_1", "op": "Shape", "input": ["stft/frame/PadV2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "stft/frame/strided_slice_1", "op": "StridedSlice", "input": ["stft/frame/Shape_1", "stft/frame/strided_slice_1/stack", "stft/frame/strided_slice_1/stack_1", "stft/frame/strided_slice_1/stack"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "stft/frame/floordiv_3", "op": "FloorDiv", "input": ["stft/frame/strided_slice_1", "stft/frame_step"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "stft/frame/mul_1", "op": "Mul", "input": ["stft/frame/floordiv_3", "stft/frame_step"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "stft/frame/concat_2/values_1", "op": "Pack", "input": ["stft/frame/floordiv_3", "stft/frame_step"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "ConstantFolding/stft/frame/concat_1/values_1_const_axis", "op": "Const", "input": ["^stft/frame/mul_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "stft/frame/concat_2", "op": "ConcatV2", "input": ["stft/frame/split", "stft/frame/concat_2/values_1", "stft/frame/split:2", "stft/frame/split/split_dim"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "stft/frame/concat_1/values_1", "op": "ExpandDims", "input": ["stft/frame/mul_1", "ConstantFolding/stft/frame/concat_1/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "stft/frame/concat_1", "op": "ConcatV2", "input": ["stft/frame/split", "stft/frame/concat_1/values_1", "stft/frame/split:2", "stft/frame/split/split_dim"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "stft/frame/StridedSlice", "op": "StridedSlice", "input": ["stft/frame/PadV2", "stft/frame/zeros_like", "stft/frame/concat_1", "inverse_stft_1/overlap_and_add/strided_slice_4/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "stft/frame/Reshape_1", "op": "Reshape", "input": ["stft/frame/StridedSlice", "stft/frame/concat_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "stft/frame/GatherV2", "op": "GatherV2", "input": ["stft/frame/Reshape_1", "stft/frame/add_3", "stft/frame/strided_slice"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "stft/frame/Reshape_4", "op": "Reshape", "input": ["stft/frame/GatherV2", "stft/frame/concat_3"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "stft/mul", "op": "Mul", "input": ["stft/frame/Reshape_4", "stft/hann_window/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "stft/rfft", "op": "RFFT", "input": ["stft/mul", "stft/rfft/packed"]}, {"name": "transpose_1", "op": "Transpose", "input": ["stft/rfft", "transpose_1/perm"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "Shape", "op": "Shape", "input": ["transpose_1"], "attr": {"T": {"type": "DT_COMPLEX64"}, "out_type": {"type": "DT_INT32"}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["Shape", "strided_slice/stack", "stft/frame/strided_slice_1/stack", "stft/frame/strided_slice_1/stack"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, 